Project1/app/controllers/soundcloud_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`soundcloud_user_id` = 37157148  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`soundcloud_user_id`, `soundcloud_access_token`, `created_at`, `updated_at`) VALUES (37157148, '1-159995-37157148-a4d2ebe6fca3c3', '2015-11-04 23:20:41', '2015-11-04 23:20:41')
---
  def connected
    client = Soundcloud.new(:client_id => ENV['SOUNDCLOUD_CLIENT_ID'],
                            :client_secret => ENV['SOUNDCLOUD_CLIENT_SECRET'],
                            :redirect_uri => 'http://localhost:3000/soundcloud/oauth-callback')

    access_token = client.exchange_token(:code => params[:code])
    client = Soundcloud.new(:access_token => access_token['access_token'])

    soundcloud_user = client.get('/me')
    unless User.where(:soundcloud_user_id => soundcloud_user['id']).present?
      User.create_from_soundcloud(soundcloud_user, access_token)